### Getting Started with Pandas

Contains data structures and data manipulation tools designed to make data cleaning and analysis fast and east in python.

pandas is often used in tandem with numerical computing tools like NumPy and SciPy, analytical libraries like statsmodels and scikit-learn, and data visualization libraries like matplotlib.

pandas adopt numpy's array based operations and a preference for data processing without using loops

pandas is designed for working with heterogenous and tabular data

In [1]:
import pandas as pd

#### Introduction to pandas Data Structures

##### Series
*It is a one dimensional array-like object containing a sequence of values(of similar types of Numpy types) and as associated array of data labels called index.*

In [2]:
obj = pd.Series([4,7,-5,2,7])

In [3]:
obj
# it also prints the indexes since we have not given it has chosen by default

0    4
1    7
2   -5
3    2
4    7
dtype: int64

In [4]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 2, 7]
Length: 5, dtype: int64

In [5]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
obj2 = pd.Series([4,7,-3,5,6],index=['d','e','f','g','h'])

In [7]:
obj2

d    4
e    7
f   -3
g    5
h    6
dtype: int64

In [8]:
obj2['f']

-3

In [9]:
obj2['f'] = 6

In [10]:
obj2

d    4
e    7
f    6
g    5
h    6
dtype: int64

In [11]:
obj2[['d','e','f']] # this ['d','e','f'] is interpreted as a python list of indices

d    4
e    7
f    6
dtype: int64

In [12]:
# using numpy functions 

obj2[obj2>5]

e    7
f    6
h    6
dtype: int64

In [13]:
obj2*2

d     8
e    14
f    12
g    10
h    12
dtype: int64

In [14]:
import numpy as np

In [15]:
np.exp(obj2)

d      54.598150
e    1096.633158
f     403.428793
g     148.413159
h     403.428793
dtype: float64

Series can also be interpreted as a fixed-length, ordered dict, that maps indexes to data values.

In [16]:
'f' in obj2

True

In [17]:
'b' in obj2

False

In [18]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [19]:
obj3 = pd.Series(sdata) # if you have a python dict containing data you can convert it to pd Series

In [20]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [22]:
obj4 = pd.Series(sdata,index= states) # index were overridden for sdata.

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [26]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
# automatically aligns by index labels in arithmetic operations
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
obj3+obj4 # similar to join operation

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [30]:
obj4.name = 'population'

In [31]:
obj4.index.name = 'state'

In [32]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

A series's index can be altered in-place by assignment

In [33]:
obj

0    4
1    7
2   -5
3    2
4    7
dtype: int64

In [34]:
obj.index = ['Bob','Steve','Shrey','Kulu','Adi']

In [35]:
obj

Bob      4
Steve    7
Shrey   -5
Kulu     2
Adi      7
dtype: int64

##### Data Frame
1. *Represents a rectangular table of data and contains an ordered, named collection of columns, each of which can be a different value type*
2. *It has both row and columns index*

In [36]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada','Nevada'],'year': [2000, 2001, 2002, 2001, 2002, 2003],'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [37]:
frame = pd.DataFrame(data)

In [38]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [39]:
frame.head() # first five rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [40]:
pd.DataFrame(data,columns=['year','pop','state'])

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [41]:
frame2 = pd.DataFrame(data,columns=['year','pop','state','debt'],index=['one','two','three','four','five','six'])

In [42]:
frame2

       year  pop   state debt
one    2000  1.5    Ohio  NaN
two    2001  1.7    Ohio  NaN
three  2002  3.6    Ohio  NaN
four   2001  2.4  Nevada  NaN
five   2002  2.9  Nevada  NaN
six    2003  3.2  Nevada  NaN

In [43]:
frame2.columns # columns can be directly retrieved as a series either by dict like notation, or by attribute

Index(['year', 'pop', 'state', 'debt'], dtype='object')

In [44]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [45]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [46]:
# rows can also be retrieved by position or name with the special loc attribute
frame2.loc['three']

year     2002
pop       3.6
state    Ohio
debt      NaN
Name: three, dtype: object

In [47]:
frame2['debt'] = 16.5

In [48]:
frame2

       year  pop   state  debt
one    2000  1.5    Ohio  16.5
two    2001  1.7    Ohio  16.5
three  2002  3.6    Ohio  16.5
four   2001  2.4  Nevada  16.5
five   2002  2.9  Nevada  16.5
six    2003  3.2  Nevada  16.5

In [49]:
frame2['debt'] = np.arange(6.0)

In [50]:
frame2

       year  pop   state  debt
one    2000  1.5    Ohio   0.0
two    2001  1.7    Ohio   1.0
three  2002  3.6    Ohio   2.0
four   2001  2.4  Nevada   3.0
five   2002  2.9  Nevada   4.0
six    2003  3.2  Nevada   5.0

In [51]:
val = pd.Series([1.2,1.5,1.7], index = ['two','four','five'])

In [52]:
frame2['debt'] = val

In [53]:
frame2

       year  pop   state  debt
one    2000  1.5    Ohio   NaN
two    2001  1.7    Ohio   1.2
three  2002  3.6    Ohio   NaN
four   2001  2.4  Nevada   1.5
five   2002  2.9  Nevada   1.7
six    2003  3.2  Nevada   NaN

In [54]:
frame2['eastern'] = frame2.state=='Ohio'

In [55]:
frame2

       year  pop   state  debt  eastern
one    2000  1.5    Ohio   NaN     True
two    2001  1.7    Ohio   1.2     True
three  2002  3.6    Ohio   NaN     True
four   2001  2.4  Nevada   1.5    False
five   2002  2.9  Nevada   1.7    False
six    2003  3.2  Nevada   NaN    False

In [56]:
del frame2['eastern']

In [57]:
frame2.columns

Index(['year', 'pop', 'state', 'debt'], dtype='object')

In [58]:
# another form of data is nested dict of dicts

pop = {'Ohio':{2000:1.5,2001:1.7,2002:3.6},'Nevada':{2001:2.4,2002:2.9}}

In [59]:
pop

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [60]:
frame3 = pd.DataFrame(pop)

In [61]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [62]:
# transpose 

frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [63]:
pd.DataFrame(pop,index = [2001,2002,2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [64]:
pdata = {'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}

In [65]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [66]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [67]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [68]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [69]:
frame2.to_numpy()

array([[2000, 1.5, 'Ohio', nan],
       [2001, 1.7, 'Ohio', 1.2],
       [2002, 3.6, 'Ohio', nan],
       [2001, 2.4, 'Nevada', 1.5],
       [2002, 2.9, 'Nevada', 1.7],
       [2003, 3.2, 'Nevada', nan]], dtype=object)

#### Index Objects

pandas's index objects are responsible for holding the axis labels and other metadata

In [70]:
obj = pd.Series(range(3),index= ['a','b','c'])

In [71]:
index = obj.index

In [72]:
index

Index(['a', 'b', 'c'], dtype='object')

In [73]:
index[1:]

Index(['b', 'c'], dtype='object')

Index objects are immutable and thus can't be modified by the user which makes it safer to share index objects among data structures

In [74]:
labels = pd.Index(np.arange(3))

In [75]:
labels

Index([0, 1, 2], dtype='int32')

In [76]:
obj2 = pd.Series([1.5,2.5,-3.2],index=labels)

In [77]:
obj2

0    1.5
1    2.5
2   -3.2
dtype: float64

In [78]:
obj2.index is labels

True

In [79]:
# an index also behaves like a fixed size set
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [80]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [81]:
'Ohio' in frame3.columns

True

In [82]:
2003 in frame3.index

False

Unlike python sets, pandas index can contain duplicate labels.

In [83]:
dup_labels = pd.Index(['foo','foo','bar','bar'])

In [84]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')